Hi @AlbertoPazFb , I was not able to reproduce this issue on AWSCC 1.42.0 and terraform version v1.10.5. The `fleet_type`,  `new_game_session_protection_policy` and `certificate_configuration` properties are not relevant to Anywhere fleets, so you can remove them. Can you try removing those properties and upgrading the terraform version and AWSCC to the latest version?

My tests config:
```
provider "aws" {
  region = "us-west-2"
}

resource "awscc_gamelift_location" "custom_gamelift_anywhere" {
  location_name = "custom-gamelift-anywhere"
}

resource "awscc_gamelift_location" "custom_gamelift_anywhere_new" {
  location_name = "custom-gamelift-anywhere-new"
}

resource "awscc_gamelift_fleet" "gamelift_anywhere_fleet" {
  name                               = "gamelift-anywhere-fleet"
  compute_type                       = "ANYWHERE" 

  locations = [
    {
      location : awscc_gamelift_location.custom_gamelift_anywhere.id,
      location_capacity : null
    },
    {
      location : awscc_gamelift_location.custom_gamelift_anywhere_new.id,
      location_capacity : null
    }
  ]

  metric_groups = [
    "default"
  ]
}
```
```
❯ terraform plan
awscc_gamelift_location.custom_gamelift_anywhere: Refreshing state... [id=custom-gamelift-anywhere]
awscc_gamelift_fleet.gamelift_anywhere_fleet: Refreshing state... [id=fleet-35e19f27-021c-4937-8074-503ef18b8468]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # awscc_gamelift_fleet.gamelift_anywhere_fleet will be updated in-place
  ~ resource "awscc_gamelift_fleet" "gamelift_anywhere_fleet" {
      + anywhere_configuration             = (known after apply)
      + apply_capacity                     = (known after apply)
      + build_id                           = (known after apply)
      + description                        = (known after apply)
      + desired_ec2_instances              = (known after apply)
      + ec2_inbound_permissions            = (known after apply)
      + ec2_instance_type                  = (known after apply)
        id                                 = "fleet-35e19f27-021c-4937-8074-503ef18b8468"
      + instance_role_arn                  = (known after apply)
      + instance_role_credentials_provider = (known after apply)
      ~ locations                          = [
          ~ {
              + location_capacity = (known after apply)
                # (1 unchanged attribute hidden)
            },
          + {
              + location          = (known after apply)
              + location_capacity = (known after apply)
            },
        ]
      + log_paths                          = (known after apply)
      + max_size                           = (known after apply)
      + min_size                           = (known after apply)
        name                               = "gamelift-anywhere-fleet"
      + peer_vpc_aws_account_id            = (known after apply)
      + peer_vpc_id                        = (known after apply)
      + resource_creation_limit_policy     = (known after apply)
      + runtime_configuration              = (known after apply)
      + scaling_policies                   = (known after apply)
      + script_id                          = (known after apply)
      + server_launch_parameters           = (known after apply)
      + server_launch_path                 = (known after apply)
      + tags                               = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # awscc_gamelift_location.custom_gamelift_anywhere_new will be created
  + resource "awscc_gamelift_location" "custom_gamelift_anywhere_new" {
      + id            = (known after apply)
      + location_arn  = (known after apply)
      + location_name = "custom-gamelift-anywhere-new"
      + tags          = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```